routes/web.php

});
Route::get('/get-owner-employee',function (){
    $ownerId = \Illuminate\Support\Facades\Request::get('owner_id');
    $employees = \App\Models\UserDetails::where('owner_id',$ownerId)->get();
---
select * from "user_details" where "owner_id" = '3'

    $checker = [];
    $helper = [];
    foreach ($employees as $employee){
        $em = \App\User::findOrFail($employee->user_id);
---
select * from "users" where "users"."id" = 11 limit 1