app/Http/Controllers/BusController.php

    public function index()
    {
        $data['page_title'] = "Bus List";
        $data['buses'] = Bus::with('owner')->latest()->get();
        $data['owners'] = User::where('customer_type',2)->latest()->get();
---
select * from "buses" order by "created_at" desc
select * from "users" where "customer_type" = 2 order by "created_at" desc