app/Http/Controllers/DriverController.php

    public function index()
    {
        $data['page_title'] = "Driver List";
        $user = Auth::user();
        $data['owners'] = User::where('customer_type',2)->latest()->get();//owner
        if ($user->hasRole('admin')){
            $data['drivers'] = User::where('customer_type',3)->latest()->get();//driver
        }else{
            $drivers = [];
            $userDetails = \App\Models\UserDetails::where('owner_id',$user->id)->get();
            foreach ($userDetails as $em){
                $employee = User::findOrFail($em->user_id);
---
select * from "users" where "customer_type" = 2 order by "created_at" desc
select * from "users" where "customer_type" = 3 order by "created_at" desc
select * from "user_details" where "owner_id" = 4
select * from "users" where "users"."id" = 10 limit 1