app/Http/Controllers/FareController.php

    public function index(Request $request){

      $routes =   Route::latest()->get(['id','name']);
      $data['page_title'] = "Route List";
      $data['routes'] =$routes;
      $data["selected_route"] = null;

      if(isset($request->route)){

          $id = htmlspecialchars($request->route);
          $selected_route = Route::find($id);
          $data['selected_route'] = $selected_route;

          //get stoppages
          $stoppages = Stopage::all();
          $stoppages_arr = [];
          $price_arr = [];
          foreach ($stoppages as $stoppage){
              $stoppages_arr[$stoppage->id] = $stoppage->name;
          }

          // get pricing
          $fare = Fare::where('route_id',$id)->first();
---
select "id", "name" from "routes" order by "created_at" desc
select * from "routes" where "routes"."id" = '1' limit 1
select * from "stopages"
select * from "fares" where "route_id" = '1' limit 1

    public function pricing(Request $request){


        $data = json_encode($request->except(['route_id','_token']));

        $isExist = Fare::where('route_id',$request->route_id)->first();
---
select * from "fares" where "route_id" = '2' limit 1