app/Http/Controllers/HelperController.php

    public function edit($id)
    {
        $data['page_title'] = "Helper Edit";
        $data['helper'] = User::with('userDetails')->findOrFail($id);
        $data['owners'] = User::where('customer_type',2)->latest()->get();//owner
---
select * from "user_details" where 0 = 1
select * from "users" where "users"."id" = '17' limit 1
select * from "users" where "customer_type" = 2 order by "created_at" desc