app/Http/Controllers/HomeController.php

    public function dashboard()
    {

        $data['total_bus'] = Bus::count();
        $data['total_owner'] = User::where('customer_type',2)->count();
        $data['total_route'] = Route::count();
        $data['total_ticket_sale'] = Ticket_sale::where('status',1)->sum('fare_amount');


        $data['page_title'] = "Dashboard";
        $data['routes'] = Route::latest()->get();
---
select count(*) as aggregate from "users" where "customer_type" = 2
select count(*) as aggregate from "routes"
select sum("fare_amount") as aggregate from "ticket_sales" where "status" = 1
select * from "routes" order by "created_at" desc