app/Http/Controllers/OwnerController.php

    public function index()
    {
        $data['page_title'] = "Owner List";
        $data['owners'] = User::where('customer_type',2)->latest()->get();
---
select * from "users" where "customer_type" = 2 order by "created_at" desc