app/Http/Controllers/PermissionController.php

select * from "roles" order by "id" desc
---
    public function create()
    {
        $data['page_title'] = 'Permission Create';
        $data['roles'] = Role::orderByDesc('id')->get();