app/Http/Controllers/RoleController.php

    public function index()
    {
        $page_title = "Manage Role";
        $roles = Role::with('permissions')->orderBy('id','desc')->get();
---
select "permissions".*, "role_has_permissions"."role_id" as "pivot_role_id", "role_has_permissions"."permission_id" as "pivot_permission_id" from "permissions" inner join "role_has_permissions" on "permissions"."id" = "role_has_permissions"."permission_id" where "role_has_permissions"."role_id" in (1, 2)
select * from "roles" order by "id" desc