app/Http/Controllers/RouteController.php

select * from "routes" order by "created_at" desc
select * from "stopages" where "status" = 1 order by "created_at" desc
---
    public function index()
    {
        $data['page_title'] = "Route List";
        $data['routes'] = Route::latest()->get();
        $data['stoppages'] = Stopage::where('status',1)->latest()->get();

select * from "routes" where "routes"."id" = '5' limit 1
update "routes" set "stoppage_id" = '"[\"11\",\"10\",\"9\",\"8\",\"20\",\"18\"]"', "updated_at" = '2023-08-13 17:07:50' where "id" = 5
---
    public function update(Request $request, Route $route)
    {
        //return $request;
        $route = Route::findOrFail($request->id);
        $valid = $this->validate($request,[
            'name' => 'required|unique:routes,name,'.$route->id,
            'stoppage_id.*' => 'required',
        ]);
        if (!$valid){
            return response()->json($valid);
        }

        $in = $request->except('stoppage_id');
        $stoppage_id = $request->input('stoppage_id');
        $in["stoppage_id"] = json_encode($stoppage_id);
        $route->fill($in)->save();