app/Http/Controllers/StopageController.php

select * from "stopages" order by "created_at" desc
---
    public function index(){
        $data['page_title'] = "Stoppage List";
        $data['stoppages'] = Stopage::latest()->get();

insert into "stopages" ("name", "status", "updated_at", "created_at") values ('Mirpur 12', 1, '2023-06-15 04:29:06', '2023-06-15 04:29:06') returning "id"
---
    public function Store(Request $request){
        $valid =  $this->validate($request,[
            'name' => 'required|string|unique:stopages,name',
        ]);

        if(!$valid){
            return response()->json();
        }
        $in = $request->all();
        $in['status'] = 1;
        Stopage::create($in);

select * from "stopages" where "stopages"."id" = '7' limit 1
update "stopages" set "status" = '7', "updated_at" = '2023-06-05 10:14:08' where "id" = 7
---
    public function update(Request $request){
        $stoppage = Stopage::findOrFail($request->id);
        $valid = $this->validate($request,[
            'name' => 'required|string|unique:stopages,name,'.$stoppage->id,
        ]);


        if(!$valid){
            return response()->json();
        }

        $in = $request->all();
        $stoppage->fill($in)->save();