app/Http/Controllers/TicketController.php

select * from "fares"
---
                    return view('admin.ticket.trip-search',compact('page_title','trips', 'fare_amount','from',
                    'to','buses','from_id','to_id'));
                }else{
                    return redirect()->back()->with("error",'Fare is not calculated yet !');

select * from "ticket_sales" where "ticket_sales"."id" = '6' limit 1
---
    public function showTripTickets($trip_id){


        if($trip_id < 1 || !is_numeric($trip_id)){
            return view('404');
        }

        $ticket_sales = Ticket_sale::where('trip_id',$trip_id)->orderBy('id','DESC')->get();
        $page_title = "Tickets List";

        for($i=0; count($ticket_sales)>$i; $i++) {
            //$trip_info = Trip::where('id',$ticket_sales[$i]->trip_id)->first();
            //$ticket_sales[$i]->trip_info = $trip_info;

            //stoppage name
            $ticket_sales[$i]->from = Stopage::where('id',$ticket_sales[$i]->from)->first()->name;

update "ticket_sales" set "status" = 1, "payment_by" = 'On cash', "updated_at" = '2023-08-14 07:06:22' where "id" = 6
---
    public function ticketStatusUpdate($ticket_id){

        $ticket = Ticket_sale::findOrFail($ticket_id);
        $ticket->update([
            'status' => 1,
            'payment_by' => 'On cash'
        ]);