app/Http/Controllers/TicketController.php

    public function index(){
        $stoppages = Stopage::latest()->get();
---
select * from "stopages" order by "created_at" desc

    public function searchTrip(Request $request){

        //dd($request);
        $page_title = "Trip List";
        $route_id = $this->getRoute($request->from,$request->to);
//        dd($route_id);

        if($route_id){
            //get trip info

            $now = date("Y-m-d H:i:s");
            //dd($now);
            $trips = Trip::where('route',$route_id)
                          ->where('start_time', '>',$now)
                            ->get();
            if(count($trips)){
                //dd($trip);

                //get fare amount
                $fare_amount = $this->getFare($request->from,$request->to,$route_id);
                if($fare_amount){
                    $from_id = $request->from;
                    $to_id = $request->to;
                    $from = Stopage::select('name')->where('id',$request->from)->first()->name;
                    $to = Stopage::select('name')->where('id',$request->to)->first()->name;
---
select * from "trips" where "route" = 1 and "start_time" > '2023-08-12 13:51:57'
select "name" from "stopages" where "id" = '1' limit 1

    public function getRoute($from,$to){

        $routes = Route::get();
---
select * from "routes"

    public function getFare($from,$to,$route_id){
        $fares = Fare::where('route_id',$route_id)->first();
---
select * from "fares" where "route_id" = 1 limit 1

    public function ticketConfirmation(Request $request){

        $request->validate([
            'totalTicket' => 'required'
        ]);

        $trip = Trip::where('id',$request->trip_id)->first();

        if($trip->total_seat < $request->totalTicket){
            //echo "Requested seat is not available !!";
            return redirect()->back()->with("error",'Requested seat is not available !!');
        }

        $fare_amount_total = $request->totalTicket * $request->fare_amount;
        $user = auth()->user();

        // make unique ticket serial number
        $bus = Bus::findOrFail($trip->bus_id);
        $ticketId = Ticket_sale::latest()->first();
        if ($ticketId)
        {
            $serial = date('dmY').$bus->id.$ticketId->id;
        }
        else{
            $tId = 1;
            $serial = date('dmY').$bus->id.$tId;
        }

        //create ticket
        $ticket = Ticket_sale::create([
            "serial"=> $serial,
            "issued_by"=> $user->id,
            "trip_id"=> $trip->id,
            "from"=> $request->from_id,
            "to"=> $request->to_id,
            "fare_amount"=> $fare_amount_total,
            "total_seat"=> $request->totalTicket
        ]);


        // now reduce available seat
        $trip->update([
            'total_seat' => $trip->total_seat - $request->totalTicket
        ]);

        $ticket_sales = Ticket_sale::findOrFail($ticket->id);

        $trip_info = Trip::where('id',$ticket_sales->trip_id)->first();
        $ticket_sales->trip_info = $trip_info;

        $ticket_sales->from = Stopage::where('id',$ticket_sales->from)->first()->name;
        $ticket_sales->to = Stopage::where('id',$ticket_sales->to)->first()->name;
---
select * from "trips" where "id" = '8' limit 1
select * from "ticket_sales" order by "created_at" desc limit 1
insert into "ticket_sales" ("serial", "issued_by", "trip_id", "from", "to", "fare_amount", "total_seat", "payment_by", "isStudent", "updated_at", "created_at") values ('12082023315', 1, 8, '1', '3', 5, '1', 'On cash', '1', '2023-08-12 10:07:55', '2023-08-12 10:07:55') returning "id"
update "trips" set "total_seat" = 3, "updated_at" = '2023-08-12 10:07:55' where "id" = 8
select * from "ticket_sales" where "ticket_sales"."id" = 16 limit 1
select * from "trips" where "id" = 8 limit 1
select * from "stopages" where "id" = 1 limit 1

    public function purchaseHistory(){
        $user = auth()->user();
        $ticket_sales = Ticket_sale::where('issued_by',$user->id)->get();
        $page_title = "Purchase History";

        for($i=0; count($ticket_sales)>$i; $i++) {
            $trip_info = Trip::where('id',$ticket_sales[$i]->trip_id)->first();
            $ticket_sales[$i]->trip_info = $trip_info;

            //stoppage name
            $ticket_sales[$i]->from = Stopage::where('id',$ticket_sales[$i]->from)->first()->name;
            $ticket_sales[$i]->to = Stopage::where('id',$ticket_sales[$i]->to)->first()->name;
---
select * from "ticket_sales" where "issued_by" = 1
select * from "ticket_sales" where "issued_by" = 15 order by "id" desc

    public function ticketPdf($id)
    {

        $ticket_sales = Ticket_sale::findOrFail($id);

        $trip_info = Trip::where('id',$ticket_sales->trip_id)->first();
        $ticket_sales->trip_info = $trip_info;

        $ticket_sales->from = Stopage::where('id',$ticket_sales->from)->first()->name;
        $ticket_sales->to = Stopage::where('id',$ticket_sales->to)->first()->name;
---
select * from "ticket_sales" where "ticket_sales"."id" = '9' limit 1
select * from "trips" where "id" = 8 limit 1
select * from "stopages" where "id" = 11 limit 1
select * from "stopages" where "id" = 1 limit 1

    public function ticketOptions($trip_id){

        $trip = Trip::findOrFail($trip_id);
        $stoppages = Stopage::latest()->get();
        $route = Route::findOrFail($trip->route);
        $fares = Fare::where('route_id',$route->id)->first();
---
select * from "trips" where "trips"."id" = '8' limit 1
select * from "stopages" order by "created_at" desc
select * from "routes" where "routes"."id" = 1 limit 1
select * from "fares" where "route_id" = 1 limit 1