app/Http/Controllers/TicketCheckerController.php

select * from "user_details" where 0 = 1
select * from "users" where "users"."id" = '15' limit 1
select * from "users" where "customer_type" = 2 order by "created_at" desc
---
    public function edit($id)
    {
        $data['page_title'] = "Ticket Checker Edit";
        $data['checker'] = User::with('userDetails')->findOrFail($id);
        $data['owners'] = User::where('customer_type',2)->latest()->get();//owner