app/Http/Controllers/TicketController.php

    public function purchaseHistory(){
        $user = auth()->user();
        $ticket_sales = Ticket_sale::where('issued_by',$user->id)->get();
---
select * from "ticket_sales" where "issued_by" = 1