app/Http/Controllers/TripController.php

        $data['drivers'] = $driver;
        $data['checkers'] = $checker;
        $data['helpers'] = $helper;
        $data['routes'] = Route::latest()->get();
---
select * from "routes" order by "created_at" desc

    public function getRoutes(){
        $routes = Route::latest()->get();
---
select * from "routes" order by "created_at" desc