app/Http/Controllers/TripController.php

select * from "trips" order by "created_at" desc
select * from "routes" order by "created_at" desc
select * from "buses" order by "created_at" desc
select * from "users" where "customer_type" = 3 order by "created_at" desc
select * from "users" where "customer_type" = 4 order by "created_at" desc
select * from "users" where "customer_type" = 6 order by "created_at" desc
---
    public function index(){
        $data['page_title'] = "Trip List";
        $user = Auth::user();
        if ($user->hasRole('admin')){
            $data['trips'] = Trip::with('bus','driver','helper','checker')->latest()->get();
        }else{
            $data['trips'] = Trip::with('bus','driver','helper','checker')->where('owner_id',$user->id)->latest()->get();

        }
        $data['routes'] = Route::latest()->get();
        $data['routesArr'] = $this->getRoutes();
        $data['busesArr'] = $this->getBuses();
        $data['buses'] = Bus::latest()->get();
        $data['drivers'] = User::latest()->where('customer_type',3)->get();
        $data['checkers'] = User::latest()->where('customer_type',4)->get();
        $data['helpers'] = User::latest()->where('customer_type',6)->get();

select * from "routes" order by "created_at" desc
select * from "buses" order by "created_at" desc
select * from "users" where "customer_type" = 2 order by "created_at" desc
select * from "users" where "customer_type" = 3 order by "created_at" desc
select * from "users" where "customer_type" = 4 order by "created_at" desc
---
    public function create(){
        $data['page_title'] = "Trip Create";
        $data['routes'] = Route::latest()->get();
        $data['buses'] = Bus::latest()->get();
        $user = Auth::user();
        if ($user->hasRole('admin')){
            $data['owners'] = User::latest()->where('customer_type',2)->get(); //owner
        }else{
            $data['owners'] = User::latest()->where('customer_type',2)->where('id','=',$user->id)->get(); //owner

        }
        $data['drivers'] = User::latest()->where('customer_type',3)->get();//driver
        $data['checkers'] = User::latest()->where('customer_type',4)->get();//checker
        $data['helpers'] = User::latest()->where('customer_type',6)->get();// helper

select * from "trips" where "trips"."id" = '7' limit 1
select * from "buses" where "owner_id" = 4 order by "created_at" desc
select * from "users" where "customer_type" = 2 order by "created_at" desc
select * from "user_details" where "owner_id" = 4
select * from "users" where "users"."id" = 10 limit 1
select * from "routes" order by "created_at" desc
---
    public function edit($id)
    {
        $data['page_title'] = "Trip Edit";
        $data['trip'] = Trip::with('driver','bus','helper','checker')->findOrFail($id);
        $data['buses'] = Bus::where('owner_id',$data['trip']->owner_id)->latest()->get();
        $user = Auth::user();
        if ($user->hasRole('admin')){
            $data['owners'] = User::latest()->where('customer_type',2)->get(); //owner
        }else{
            $data['owners'] = User::latest()->where('customer_type',2)->where('id','=',$user->id)->get(); //owner

        }
        $employees = UserDetails::where('owner_id',$data['trip']->owner_id)->get();
        $driver = [];
        $checker = [];
        $helper = [];
        foreach ($employees as $employee){
            $em = \App\User::findOrFail($employee->user_id);
            if ($em->customer_type == 3){
                $driver[] = $em;
            }elseif ($em->customer_type == 4){
                $checker[] = $em;
            }else{
                $helper[] = $em;
            }
        }
        $data['drivers'] = $driver;
        $data['checkers'] = $checker;
        $data['helpers'] = $helper;
        $data['routes'] = Route::latest()->get();

select * from "routes" order by "created_at" desc
---
    public function getRoutes(){
        $routes = Route::latest()->get();