app/Http/Controllers/TripController.php

    public function update(Request $request,$id){

        $valid = $request->validate([
            'start_time' => 'required',
            'route' => 'required',
            'driver' => 'required',
            'helper' => 'required',
            'contacter' => 'required',
            'bus' => 'required',
            'total_seat' => 'required'
        ]);

        if(!$valid){
            return response()->json();
        }

        $trip = Trip::findOrFail($request->id);
        $in = $request->all();
        $in['start_time'] = Carbon::parse($request->start_time)->format('Y-m-d H:i:s');
        $in['end_time'] =  Carbon::parse($request->end_time)->format('Y-m-d H:i:s');

        $trip->fill($in)->save();
---
select * from "trips" where "trips"."id" = '1' limit 1
update "trips" set "start_time" = '2023-07-07 15:12:00', "updated_at" = '2023-07-07 12:09:09' where "id" = 1

    public function getRoutes(){
        $routes = Route::latest()->get();
---
select * from "routes" order by "created_at" desc