app/Http/Controllers/UserController.php

select * from "users"
---
    public function index()
    {
        $page_title = "Manage User";
        $data = User::with('roles')->get();

select * from "roles"
---
    public function edit($id) {
        $data['page_title'] = "User Edit";
        $data['user'] = User::findOrFail($id);
        $data['roles'] = Role::get();

select * from "users" where "users"."id" = '20' limit 1
---
    public function update(Request $request, $id)
    {
        $user = User::findOrFail($id);

delete from "users" where "id" = 12
select * from "users" where "users"."id" = '12' limit 1
---
    public function destroy(Request $request,$id)
    {

        User::find($id)->delete();